# Practicing join statements in SQL

In [1]:
# connecting to the database
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

Display the names of all the employees in Boston

In [6]:
cur.execute("""SELECT firstName, lastName 
               FROM employees 
               JOIN offices 
               USING(officeCode) 
               WHERE city = 'Boston';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

# notice the using clause is used here because the column names are identical

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

Are there any offices that have zero employees?

In [7]:
# Combine the employees and offices tables and use a group by.
cur.execute("""SELECT o.officeCode, o.city, COUNT(e.employeeNumber) AS n_employees
               FROM offices AS o 
               LEFT JOIN employees AS e
               USING(officeCode)
               GROUP BY officeCode
               HAVING n_employees = 0;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   officeCode    city  n_employees
0          27  Boston            0

In [ ]:
cur.execute('''select * from employees as e''')